/****************************************************************************************************************************************************************
** 版权:          2017-2027,深圳市信为科技发展有限公司
** 文件名:        SoftSpi.c
** 作者:          庄明群
** 版本:          V1.0.0
** 日期:          2017-05-09
** 描述:          软件模拟SPI通信
** 功能:          SPI驱动
*****************************************************************************************************************************************************************
** 修改者:        No
** 版本:          No
** 修改内容:      No
** 日期:          No
****************************************************************************************************************************************************************/

#include "SoftSpi.h"
#include <intrinsics.h>

//****************************************************************************************************************************************************************
// 名称               : SPI_Init()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI 通信接口初始化
// 输入参数           : 无
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

void SPI_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  
  //GPIOA时钟使能
  if((GPIOA == SPI_NSS_PORT) || (GPIOA == SPI_MOSI_PORT)
     || (GPIOA == SPI_SCK_PORT) || (GPIOA == SPI_MISO_PORT))
  {
    __HAL_RCC_GPIOA_CLK_ENABLE();
  }
  
  //GPIOB时钟使能
  if((GPIOB == SPI_NSS_PORT) || (GPIOB == SPI_MOSI_PORT)
     || (GPIOB == SPI_SCK_PORT) || (GPIOB == SPI_MISO_PORT))
  {
    __HAL_RCC_GPIOB_CLK_ENABLE();
  }
  
  //SPI片选配置
  GPIO_InitStruct.Pin = SPI_NSS_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(SPI_NSS_PORT, &GPIO_InitStruct);
  
  //SPI SCK配置
  GPIO_InitStruct.Pin = SPI_SCK_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(SPI_SCK_PORT, &GPIO_InitStruct);
  
  //SPI MOSI配置
  GPIO_InitStruct.Pin = SPI_MOSI_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(SPI_MOSI_PORT, &GPIO_InitStruct);
  
  //SPI MISO配置
  GPIO_InitStruct.Pin = SPI_MISO_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(SPI_MISO_PORT, &GPIO_InitStruct);
}

//****************************************************************************************************************************************************************
// 名称               : SPI_Bit_Set()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI通信电平置位
// 输入参数           : 无
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

void SPI_Bit_Set(void)
{
  SPI_SCK_SET;
  Delay_us(1);
  SPI_MOSI_SET;
  Delay_us(1);
  SPI_SCK_CLR;
  Delay_us(1);
}

//****************************************************************************************************************************************************************
// 名称               : SPI_Bit_Clr()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI通信电平置低
// 输入参数           : 无
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

void SPI_Bit_Clr(void)
{
  SPI_SCK_SET;
  Delay_us(1);
  SPI_MOSI_CLR;
  Delay_us(1);
  SPI_SCK_CLR;
  Delay_us(1);
}

//****************************************************************************************************************************************************************
// 名称               : Delay_us()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI通信微秒延时
// 输入参数           : us(延时参数)
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

void Delay_us(uint32_t us)
{
    uint32_t Us;
    //Us = (SystemCoreClock/1000000) * us;
    Us = 4 * us;
    while(Us--)
    {
    //__no_operation();
    }
}

//****************************************************************************************************************************************************************
// 名称               : SPI_Receive_8Bit()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI通信接收一字节数据
// 输入参数           : 无
// 输出参数           : 无
// 返回结果           : 接收字节
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

uint8_t SPI_Receive_8Bit(void)
{
  uint8_t ri;
  uint8_t rcvdata;
  rcvdata = 0x00;
  
  for(ri = 8; ri > 0; ri--)
  {
    rcvdata <<= 1;
    SPI_SCK_SET;
    Delay_us(1);
    
    if(SPI_MISO_STA)
    {
      rcvdata |= 0x01;
    }
    
    SPI_SCK_CLR;
    Delay_us(2);
  }
  
  return rcvdata;
}

//****************************************************************************************************************************************************************
// 名称               : SPI_Receive_24Bit()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI通信接收3字节数据
// 输入参数           : 无
// 输出参数           : 无
// 返回结果           : 32位数据
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

uint32_t SPI_Receive_24Bit(void)
{
  uint8_t ri;
  uint32_t rcvdata;
  rcvdata = 0x00000000;
  
  for(ri = 24; ri > 0; ri--)
  {
    rcvdata <<= 1;
    SPI_SCK_SET;
    Delay_us(1);
    
    if(SPI_MISO_STA)
    {
      rcvdata |= 0x01;
    }
    
    SPI_SCK_CLR;
    Delay_us(2);
  }
  
  return rcvdata;
}

//****************************************************************************************************************************************************************
// 名称               : SPI_Send_8Bit()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI通信发送一字节数据
// 输入参数           : sBit8(待发送字节)
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

void SPI_Send_8Bit(uint8_t sBit8)
{
  uint8_t si;
  uint8_t Bit8;
  Bit8 = sBit8;
  
  for(si = 0; si < 8; si++)
  {
    if(Bit8 & 0x80)
    {
      SPI_Bit_Set();
    }
    else
    {
      SPI_Bit_Clr();
    }
    
    Bit8 <<= 1;
  }
}

//****************************************************************************************************************************************************************
// 名称               : SPI_Send_16Bit()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI通信发送2字节数据
// 输入参数           : sBit16(待发送2字节)
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

void SPI_Send_16Bit(uint16_t sBit16)
{
  uint8_t si;
  uint16_t Bit16;
  Bit16 = sBit16;
  
  for(si = 0; si < 16; si++)
  {
    if(Bit16 & 0x8000)
    {
      SPI_Bit_Set();
    }
    else
    {
      SPI_Bit_Clr();
    }
    
    Bit16 <<= 1;
  }
}

//****************************************************************************************************************************************************************
// 名称               : SPI_Send_32Bit()
// 创建日期           : 2017-05-09
// 作者               : 庄明群
// 功能               : SPI通信发送4字节数据
// 输入参数           : sBit32(待发送4字节)
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

void SPI_Send_32Bit(uint32_t sBit32)
{
  uint8_t si;
  uint32_t Bit32;
  Bit32 = sBit32;
  
  for(si = 0; si < 32; si++)
  {
    if(Bit32 & 0x80000000)
    {
      SPI_Bit_Set();
    }
    else
    {
      SPI_Bit_Clr();
    }
    
    Bit32 <<= 1;
  }
}
